# Module 3: Data Retrieval with SQL (Farmer's Market Database)

This notebook demonstrates key SQL data retrieval operations using Python and MySQL.
We will use the Farmer‚Äôs Market database hosted locally on a MySQL server.
Each section includes explanations and annotated code examples to reinforce learning.

Before running this notebook, ensure:
- MySQL Server is running on `localhost`
- The `farmers_market` database is already imported
- Python packages `mysql-connector-python` and `pandas` are installed

In [1]:
# Install dependencies if needed (uncomment and run once)
# !pip install mysql-connector-python pandas

## Step 1: Connect to MySQL Server

We use `mysql.connector` to connect to the local MySQL instance.
Please replace the placeholders for `user` and `password` with your actual credentials.

In [4]:
import mysql.connector
import pandas as pd

# Establish connection to local MySQL server
conn = mysql.connector.connect(
    host="localhost",
    user="root",       # very bad practice, never use root in production, never hardcode credentials!
    password="William2025!!",   # Replace with your MySQL password
    database="farmers_market"
)

cursor = conn.cursor()
print("Succesfully Connected to MySQL database!")

Succesfully Connected to MySQL database!

## The SELECT Statement

The `SELECT` statement is used to retrieve data from one or more columns in a table.

**Basic Syntax:**
```sql
SELECT column1, column2
FROM schema.table;
```

Avoid using `SELECT *` in production queries. It's better to specify the needed columns explicitly.

In [20]:
# Example: Select all columns from the customer table. Not wise for production use, but good for learning.
query = '''
SELECT * 
FROM customer;
'''

cursor.execute(query)
df = pd.DataFrame(cursor.fetchall(), columns=[desc[0] for desc in cursor.description])
df.head()

   customer_id customer_first_name customer_last_name customer_zip
0            1                Jane             Connor        22801
1            2              Manuel               Diaz        22821
2            3                 Bob             Wilson        22821
3            4              Deanna         Washington        22801
4            5             Abigail             Harris        22801

In [23]:
# Example: Select a few specific columns from the vendor table
query = '''
SELECT 
    vendor_id,
    vendor_name,
    vendor_type
FROM vendor;
'''
 

cursor.execute(query)
df = pd.DataFrame(cursor.fetchall(), columns=[desc[0] for desc in cursor.description])
df.head()

   vendor_id                       vendor_name                    vendor_type
0          1  Chris's Sustainable Eggs & Meats                   Eggs & Meats
1          2         Hern√°ndez Salsa & Veggies  Fresh Variety: Veggies & More
2          3          Mountain View Vegetables  Fresh Variety: Veggies & More
3          4                    Fields of Corn                  Fresh Focused
4          5                Seashell Clay Shop                 Arts & Jewelry

## üîç Filtering with WHERE Clause

The `WHERE` clause filters rows based on specific conditions.

**Example:**
```sql
SELECT *
FROM farmers_market.customer
WHERE customer_zip = '22802';
```

In [ ]:
query = '''
SELECT
    customer_first_name,
    customer_last_name,
    customer_zip
FROM farmers_market.customer
WHERE customer_zip = '22802';
'''

cursor.execute(query)
df = pd.DataFrame(cursor.fetchall(), columns=[desc[0] for desc in cursor.description])
df

## üî¢ ORDER BY and LIMIT Clauses

- `ORDER BY` is used to sort the result set by one or more columns.
- `LIMIT` restricts the number of returned rows.

**Example:**
```sql
SELECT *
FROM farmers_market.vendor
ORDER BY vendor_name
LIMIT 5;
```

In [ ]:
query = '''
SELECT
    vendor_name,
    vendor_type
FROM farmers_market.vendor
ORDER BY vendor_name ASC
LIMIT 5;
'''

cursor.execute(query)
df = pd.DataFrame(cursor.fetchall(), columns=[desc[0] for desc in cursor.description])
df

## üßÆ Inline Functions: Arithmetic and Aliasing

Use inline functions to perform calculations directly in SQL.

**Example:** Multiply quantity and price, round to 2 decimal points, and assign alias.
```sql
SELECT
    ROUND(quantity * original_price, 2) AS inventory_in_dollars
FROM farmers_market.vendor_inventory;
```

In [ ]:
query = '''
SELECT
    market_date,
    vendor_id,
    quantity,
    original_price,
    ROUND(quantity * original_price, 2) AS inventory_in_dollars
FROM farmers_market.vendor_inventory
ORDER BY inventory_in_dollars DESC
LIMIT 5;
'''

cursor.execute(query)
df = pd.DataFrame(cursor.fetchall(), columns=[desc[0] for desc in cursor.description])
df

## üî§ String Functions: CONCAT

You can merge string columns using `CONCAT()`.

**Example:**
```sql
SELECT CONCAT(first_name, ' ', last_name) AS full_name FROM ...
```

In [ ]:
query = '''
SELECT
    CONCAT(vendor_owner_first_name, " ", vendor_owner_last_name) AS vendor_name,
    vendor_type
FROM farmers_market.vendor
LIMIT 5;
'''

cursor.execute(query)
df = pd.DataFrame(cursor.fetchall(), columns=[desc[0] for desc in cursor.description])
df

## ‚úÖ Wrap Up

We‚Äôve covered:

- SELECT statements
- Filtering with WHERE
- Sorting and limiting results
- Inline arithmetic
- String concatenation

Don‚Äôt forget to close your DB connection after use.

In [ ]:
cursor.close()
conn.close()
print("üîí MySQL connection closed.")